let items = [
  {
    id: 1,
    type: "chair",
    img: "./imgs/chair_1.png",
    name: "",
    ratings: 5,
    cost: 663,
    count: 1,
  },
  {
    id: 2,
    type: "chair",
    img: "./imgs/chair_2.png",
    name: "",
    ratings: 5,
    cost: 200,
    count: 1,
  },
  {
    id: 3,
    type: "chair",
    img: "./imgs/chair_3.png",
    name: "",
    ratings: 5,
    cost: 345,
    count: 1,
  },
  {
    id: 4,
    type: "chair",
    img: "./imgs/chair_4.png",
    name: "",
    ratings: 5,
    cost: 32,
    count: 1,
  },
  {
    id: 5,
    type: "chair",
    img: "./imgs/chair_4.png",
    name: "",
    ratings: 5,
    cost: 392,
    count: 1,
  },
];

let cart = [];
let navCount = document.querySelector(".navCount")

let carousel = $(".owl-carousel.sellingCarousel");

let number = 0;

// let count = document.querySelector(".count");

let btns = document.querySelectorAll(".filter-btn");
btns.forEach((el) => {
  el.addEventListener("click", (e) => {
    btns.forEach((el) => {
      if (e.target == el) {
        e.target.classList.add("ch");
      } else {
        el.classList.remove("ch");
      }
    });
  });
});

// -------------------------------------

items.forEach((el) => {
  carousel.append(`
    <div class="card">
    <div class="img">
    <img src="${el.img}" alt="">
    </div>
    <div class="slide">
    <span class="span">${el.type}</span>
    <h3>${el.name}</h3>
    <div class="rait">
    <div class="star">
    <svg
    width="19"
    height="19"
    viewBox="0 0 19 19"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    >
    <path
    d="M13.9727 10.9081C13.7754 11.0993 13.6848 11.3758 13.7297 11.6469L14.4068 15.3941C14.4639 15.7117 14.3299 16.0331 14.0641 16.2166C13.8036 16.407 13.4571 16.4299 13.173 16.2775L9.79981 14.5182C9.68252 14.4557 9.55228 14.4222 9.419 14.4184H9.21261C9.14101 14.4291 9.07095 14.4519 9.00697 14.487L5.63304 16.2547C5.46625 16.3385 5.27737 16.3682 5.0923 16.3385C4.64142 16.2532 4.34059 15.8236 4.41446 15.3705L5.0923 11.6233C5.13723 11.3499 5.0466 11.0719 4.84934 10.8777L2.09917 8.21201C1.86916 7.98886 1.78919 7.65375 1.8943 7.35138C1.99635 7.04978 2.25682 6.82968 2.57137 6.78017L6.35657 6.23105C6.64446 6.20134 6.89731 6.02617 7.02678 5.76722L8.69471 2.34756C8.73431 2.2714 8.78534 2.20133 8.84703 2.14192L8.91558 2.08861C8.95137 2.04901 8.9925 2.01626 9.0382 1.9896L9.12121 1.95914L9.25069 1.90582H9.57132C9.85769 1.93553 10.1098 2.10689 10.2415 2.36279L11.9316 5.76722C12.0534 6.01627 12.2903 6.18916 12.5637 6.23105L16.3489 6.78017C16.6688 6.82587 16.9361 7.04674 17.042 7.35138C17.1417 7.65679 17.0557 7.9919 16.8211 8.21201L13.9727 10.9081Z"
    fill="#F6B76F"
    style="
    fill: #f6b76f;
    fill: color(display-p3 0.9647 0.7176 0.4353);
    fill-opacity: 1;
    "
    />
    </svg>
    </div>
    <div class="star">
    <svg
    width="19"
    height="19"
    viewBox="0 0 19 19"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    >
    <path
    d="M13.9727 10.9081C13.7754 11.0993 13.6848 11.3758 13.7297 11.6469L14.4068 15.3941C14.4639 15.7117 14.3299 16.0331 14.0641 16.2166C13.8036 16.407 13.4571 16.4299 13.173 16.2775L9.79981 14.5182C9.68252 14.4557 9.55228 14.4222 9.419 14.4184H9.21261C9.14101 14.4291 9.07095 14.4519 9.00697 14.487L5.63304 16.2547C5.46625 16.3385 5.27737 16.3682 5.0923 16.3385C4.64142 16.2532 4.34059 15.8236 4.41446 15.3705L5.0923 11.6233C5.13723 11.3499 5.0466 11.0719 4.84934 10.8777L2.09917 8.21201C1.86916 7.98886 1.78919 7.65375 1.8943 7.35138C1.99635 7.04978 2.25682 6.82968 2.57137 6.78017L6.35657 6.23105C6.64446 6.20134 6.89731 6.02617 7.02678 5.76722L8.69471 2.34756C8.73431 2.2714 8.78534 2.20133 8.84703 2.14192L8.91558 2.08861C8.95137 2.04901 8.9925 2.01626 9.0382 1.9896L9.12121 1.95914L9.25069 1.90582H9.57132C9.85769 1.93553 10.1098 2.10689 10.2415 2.36279L11.9316 5.76722C12.0534 6.01627 12.2903 6.18916 12.5637 6.23105L16.3489 6.78017C16.6688 6.82587 16.9361 7.04674 17.042 7.35138C17.1417 7.65679 17.0557 7.9919 16.8211 8.21201L13.9727 10.9081Z"
    fill="#F6B76F"
    style="
    fill: #f6b76f;
    fill: color(display-p3 0.9647 0.7176 0.4353);
    fill-opacity: 1;
    "
    />
    </svg>
    </div>
    <div class="star">
    <svg
    width="19"
    height="19"
    viewBox="0 0 19 19"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    >
    <path
    d="M13.9727 10.9081C13.7754 11.0993 13.6848 11.3758 13.7297 11.6469L14.4068 15.3941C14.4639 15.7117 14.3299 16.0331 14.0641 16.2166C13.8036 16.407 13.4571 16.4299 13.173 16.2775L9.79981 14.5182C9.68252 14.4557 9.55228 14.4222 9.419 14.4184H9.21261C9.14101 14.4291 9.07095 14.4519 9.00697 14.487L5.63304 16.2547C5.46625 16.3385 5.27737 16.3682 5.0923 16.3385C4.64142 16.2532 4.34059 15.8236 4.41446 15.3705L5.0923 11.6233C5.13723 11.3499 5.0466 11.0719 4.84934 10.8777L2.09917 8.21201C1.86916 7.98886 1.78919 7.65375 1.8943 7.35138C1.99635 7.04978 2.25682 6.82968 2.57137 6.78017L6.35657 6.23105C6.64446 6.20134 6.89731 6.02617 7.02678 5.76722L8.69471 2.34756C8.73431 2.2714 8.78534 2.20133 8.84703 2.14192L8.91558 2.08861C8.95137 2.04901 8.9925 2.01626 9.0382 1.9896L9.12121 1.95914L9.25069 1.90582H9.57132C9.85769 1.93553 10.1098 2.10689 10.2415 2.36279L11.9316 5.76722C12.0534 6.01627 12.2903 6.18916 12.5637 6.23105L16.3489 6.78017C16.6688 6.82587 16.9361 7.04674 17.042 7.35138C17.1417 7.65679 17.0557 7.9919 16.8211 8.21201L13.9727 10.9081Z"
    fill="#F6B76F"
    style="
    fill: #f6b76f;
    fill: color(display-p3 0.9647 0.7176 0.4353);
    fill-opacity: 1;
    "
    />
    </svg>
    </div>
    <div class="star">
    <svg
    width="19"
    height="19"
    viewBox="0 0 19 19"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    >
    <path
    d="M13.9727 10.9081C13.7754 11.0993 13.6848 11.3758 13.7297 11.6469L14.4068 15.3941C14.4639 15.7117 14.3299 16.0331 14.0641 16.2166C13.8036 16.407 13.4571 16.4299 13.173 16.2775L9.79981 14.5182C9.68252 14.4557 9.55228 14.4222 9.419 14.4184H9.21261C9.14101 14.4291 9.07095 14.4519 9.00697 14.487L5.63304 16.2547C5.46625 16.3385 5.27737 16.3682 5.0923 16.3385C4.64142 16.2532 4.34059 15.8236 4.41446 15.3705L5.0923 11.6233C5.13723 11.3499 5.0466 11.0719 4.84934 10.8777L2.09917 8.21201C1.86916 7.98886 1.78919 7.65375 1.8943 7.35138C1.99635 7.04978 2.25682 6.82968 2.57137 6.78017L6.35657 6.23105C6.64446 6.20134 6.89731 6.02617 7.02678 5.76722L8.69471 2.34756C8.73431 2.2714 8.78534 2.20133 8.84703 2.14192L8.91558 2.08861C8.95137 2.04901 8.9925 2.01626 9.0382 1.9896L9.12121 1.95914L9.25069 1.90582H9.57132C9.85769 1.93553 10.1098 2.10689 10.2415 2.36279L11.9316 5.76722C12.0534 6.01627 12.2903 6.18916 12.5637 6.23105L16.3489 6.78017C16.6688 6.82587 16.9361 7.04674 17.042 7.35138C17.1417 7.65679 17.0557 7.9919 16.8211 8.21201L13.9727 10.9081Z"
    fill="#F6B76F"
    style="
    fill: #f6b76f;
    fill: color(display-p3 0.9647 0.7176 0.4353);
    fill-opacity: 1;
    "
    />
    </svg>
    </div>
    <div class="star">
    <svg
    width="19"
    height="19"
    viewBox="0 0 19 19"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    >
    <path
    d="M13.9727 10.9081C13.7754 11.0993 13.6848 11.3758 13.7297 11.6469L14.4068 15.3941C14.4639 15.7117 14.3299 16.0331 14.0641 16.2166C13.8036 16.407 13.4571 16.4299 13.173 16.2775L9.79981 14.5182C9.68252 14.4557 9.55228 14.4222 9.419 14.4184H9.21261C9.14101 14.4291 9.07095 14.4519 9.00697 14.487L5.63304 16.2547C5.46625 16.3385 5.27737 16.3682 5.0923 16.3385C4.64142 16.2532 4.34059 15.8236 4.41446 15.3705L5.0923 11.6233C5.13723 11.3499 5.0466 11.0719 4.84934 10.8777L2.09917 8.21201C1.86916 7.98886 1.78919 7.65375 1.8943 7.35138C1.99635 7.04978 2.25682 6.82968 2.57137 6.78017L6.35657 6.23105C6.64446 6.20134 6.89731 6.02617 7.02678 5.76722L8.69471 2.34756C8.73431 2.2714 8.78534 2.20133 8.84703 2.14192L8.91558 2.08861C8.95137 2.04901 8.9925 2.01626 9.0382 1.9896L9.12121 1.95914L9.25069 1.90582H9.57132C9.85769 1.93553 10.1098 2.10689 10.2415 2.36279L11.9316 5.76722C12.0534 6.01627 12.2903 6.18916 12.5637 6.23105L16.3489 6.78017C16.6688 6.82587 16.9361 7.04674 17.042 7.35138C17.1417 7.65679 17.0557 7.9919 16.8211 8.21201L13.9727 10.9081Z"
    fill="#F6B76F"
    style="
    fill: #f6b76f;
    fill: color(display-p3 0.9647 0.7176 0.4353);
    fill-opacity: 1;
    "
    />
    </svg>
    </div>
    </div>
    <div class="bottom">
    <div class="price">
    <span>$</span>
    <p>${el.cost}</p>
    </div>
    <button class="add" onclick="addItemsToCard(${el.id})">
    <svg
    width="49"
    height="50"
    viewBox="0 0 49 50"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    >
    <rect
    x="0.0195923"
    y="0.838867"
    width="48.743"
    height="48.743"
    rx="24.3715"
    fill="#0D1B39"
    style="
    fill: #0d1b39;
    fill: color(display-p3 0.0525 0.1053 0.225);
    fill-opacity: 1;
    "
    />
    <path
    d="M34.1342 25.2102C34.1342 24.4411 33.5107 23.8176 32.7415 23.8176H25.7782V16.8543C25.7782 16.0851 25.1547 15.4616 24.3856 15.4616C23.6164 15.4616 22.9929 16.0851 22.9929 16.8543V23.8176H16.0296C15.2605 23.8176 14.637 24.4411 14.637 25.2102C14.637 25.9794 15.2605 26.6029 16.0296 26.6029H22.9929V33.5662C22.9929 34.3353 23.6164 34.9588 24.3856 34.9588C25.1547 34.9588 25.7782 34.3353 25.7782 33.5662V26.6029H32.7415C33.5107 26.6029 34.1342 25.9794 34.1342 25.2102Z"
    fill="white"
    style="fill: white; fill-opacity: 1"
    />
    </svg>
    </button>
    </div>
    </div>
    </div>
    `);
});

let modalForCard = $(".modal .body");

let add = document.querySelectorAll(".add");









function addItemsToCard(id) {
  // Когда человек нажал на + => ищем этот айтем в базе данных
  let item = items.find((el) => el.id == id);
  let count2 = item.count + 1;
// Если айтем был найден в базе данных
  if (item) {
    // Делаем проверку, нет ли такого объекта уже у нас в сумке
    let exists = cart.find((el) => el.id == item.id);
    // Если есть, то просто увеличим количество
    if (exists) {
      exists.count += 1;
    } 
    // Если нет, то добавим элемент в нашу сумку
    else {
      cart.push(item);
      navCount.innerHTML = String(cart.length)
    }

    modalForCard.html("");

    // Удаляем прошлые внешние данные сумки

    cart.forEach((el) => {
        modalForCard.append(`
                      <div class="card cardIncart  ${'cardID_' + el.id}" data-id="${el.id}">
                    <div class="left">
                      <div class="item">
                        <img src="${el.img}" alt="" />
                      </div>
                      <div class="info">
                        <h3 class="name">${el.name}</h3>
                        <div class="stars">
                          <div class="star">
                            <svg
                                width="19"
                                height="19"
                                viewBox="0 0 19 19"
                                fill="none"
                                xmlns="http://www.w3.org/2000/svg"
                            >
                                <path
                                d="M13.9727 10.9081C13.7754 11.0993 13.6848 11.3758 13.7297 11.6469L14.4068 15.3941C14.4639 15.7117 14.3299 16.0331 14.0641 16.2166C13.8036 16.407 13.4571 16.4299 13.173 16.2775L9.79981 14.5182C9.68252 14.4557 9.55228 14.4222 9.419 14.4184H9.21261C9.14101 14.4291 9.07095 14.4519 9.00697 14.487L5.63304 16.2547C5.46625 16.3385 5.27737 16.3682 5.0923 16.3385C4.64142 16.2532 4.34059 15.8236 4.41446 15.3705L5.0923 11.6233C5.13723 11.3499 5.0466 11.0719 4.84934 10.8777L2.09917 8.21201C1.86916 7.98886 1.78919 7.65375 1.8943 7.35138C1.99635 7.04978 2.25682 6.82968 2.57137 6.78017L6.35657 6.23105C6.64446 6.20134 6.89731 6.02617 7.02678 5.76722L8.69471 2.34756C8.73431 2.2714 8.78534 2.20133 8.84703 2.14192L8.91558 2.08861C8.95137 2.04901 8.9925 2.01626 9.0382 1.9896L9.12121 1.95914L9.25069 1.90582H9.57132C9.85769 1.93553 10.1098 2.10689 10.2415 2.36279L11.9316 5.76722C12.0534 6.01627 12.2903 6.18916 12.5637 6.23105L16.3489 6.78017C16.6688 6.82587 16.9361 7.04674 17.042 7.35138C17.1417 7.65679 17.0557 7.9919 16.8211 8.21201L13.9727 10.9081Z"
                                fill="#F6B76F"
                                style="
                                    fill: #f6b76f;
                                    fill: color(display-p3 0.9647 0.7176 0.4353);
                                    fill-opacity: 1;
                                "
                                />
                            </svg>
                            </div>
        
                        </div>
                        <p class="itemCost"><span>$</span>${el.cost}</p>
                      </div>
                    </div>
                    <div class="right">
                      <button class="trash" onclick="removeItem(${el.id})">
                        <svg
                          width="18"
                          height="18"
                          viewBox="0 0 18 18"
                          fill="none"
                          xmlns="http://www.w3.org/2000/svg"
                        >
                          <path
                            fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M5.32501 3.75H2.25C1.83579 3.75 1.5 4.08579 1.5 4.5C1.5 4.91421 1.83579 5.25 2.25 5.25H3.04541L3.66356 15.1404C3.73767 16.3262 4.72104 17.25 5.90918 17.25H12.0908C13.279 17.25 14.2623 16.3262 14.3364 15.1404L14.9546 5.25H15.75C16.1642 5.25 16.5 4.91421 16.5 4.5C16.5 4.08579 16.1642 3.75 15.75 3.75H14.2555C14.2513 3.74997 14.2472 3.74997 14.2431 3.75H12.675C12.3275 2.03832 10.8142 0.75 9 0.75C7.18578 0.75 5.67247 2.03832 5.32501 3.75ZM6.87803 3.75H11.122C10.8131 2.87611 9.97966 2.25 9 2.25C8.02034 2.25 7.18691 2.87611 6.87803 3.75ZM13.4517 5.25H4.54834L5.16064 15.0468C5.18534 15.4421 5.51313 15.75 5.90918 15.75H12.0908C12.4869 15.75 12.8147 15.4421 12.8394 15.0468L13.4517 5.25ZM10.7093 7.50731C11.1225 7.5362 11.434 7.89459 11.4051 8.3078L11.0912 12.7968C11.0623 13.21 10.7039 13.5216 10.2907 13.4927C9.87753 13.4638 9.56598 13.1054 9.59488 12.6922L9.90878 8.20316C9.93768 7.78996 10.2961 7.47841 10.7093 7.50731ZM7.29075 7.50733C7.70395 7.47844 8.06235 7.78998 8.09124 8.20319L8.40514 12.6922C8.43404 13.1054 8.12249 13.4638 7.70929 13.4927C7.29608 13.5216 6.93769 13.2101 6.9088 12.7969L6.59489 8.30782C6.566 7.89462 6.87755 7.53622 7.29075 7.50733Z"
                            fill="white"
                            style="fill: white; fill-opacity: 1"
                          />
                        </svg>
                      </button>
                      <div class="counting">
                        <button class="plus" onclick="countingPlus(${el.id})">
                          <?xml version="1.0" encoding="utf-8"?><!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
                          <svg
                            width="14px"
                            height="14px"
                            viewBox="0 0 24 24"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                          >
                            <path
                              d="M4 12H20M12 4V20"
                              stroke="#ffffff"
                              stroke-width="2"
                              stroke-linecap="round"
                              stroke-linejoin="round"
                            />
                          </svg>
                        </button>
                        <span class="itemCount">${el.count}</span>
                        <button class="minus" onclick="countingMinus(${el.id})">
                          <?xml version="1.0" encoding="utf-8"?><!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
                          <svg
                            width="14px"
                            height="14px"
                            viewBox="0 0 24 24"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                          >
                            <path
                              d="M6 12L18 12"
                              stroke="#ffffff"
                              stroke-width="2"
                              stroke-linecap="round"
                              stroke-linejoin="round"
                            />
                          </svg>
                        </button>
                      </div>
                    </div>
                  </div>
          `);
      
          
    
    });
    
  }
}




function countingPlus(id) {
 //------------ B js
  let cartId = cart.find((el) => el.id == id)
  cartId.count += 1

  let allCounts = document.querySelectorAll(".cardIncart")


  allCounts.forEach(el => {
    if(el.getAttribute("data-id") == id){
    el.querySelector(".itemCount").innerHTML = cartId.count
    }
  })
  
  
}

function countingMinus(id) {
  let cartId = cart.find((el) => el.id == id)
  
  
  cartId.count -= 1
  
  let allCounts = document.querySelectorAll(".cardInCart")
  

  allCounts.forEach(el => {
    if (el.getAttribute("data-id") == id) {
      el.querySelector(".itemCount").innerHTML = cartId.count
      console.log("yes");
    }
  })
  
  console.log(cartId);
  
  if (cartId.count == 0) {
    removeItem(id)
  }
}



function removeItem(id) {
  // Фильтруем корзину, чтобы удалить элемент с заданным id
  let itemsInCart = cart.filter(el => el.id != id)
  cart = itemsInCart

  // Обновляем navCount.innerHTML
  navCount.textContent = cart.length

  // Находим все элементы с классом .cardIncart (обратите внимание на правильное написание класса)
  let allCounts = document.querySelectorAll(".cardIncart")

  allCounts.forEach(el => {
    if (el.getAttribute("data-id") == id) {
      el.remove()
    }
  })
}



function resatCounting() {
  
}


